#!/usr/bin/python
# -*- coding: utf-8 -*-

def print_poetry_cmd():
    poetry_cmd = """
京中有善口技者，从此君王不早朝。
巧妇难为无米之炊，有米自有巧妇来吹
在夹缝中求生存，必须得坚持不懈的、坚持到底自身有过硬的本事
情关难越，谁悲单身之狗。
关山难越，谁悲失足之女。
萍水相逢，尽是他人之妻。
老当益壮，不移好色之心。
穷且益坚，不坠孟德之志。
囊中羞涩，不改风流之志。
老骥伏枥，志在佳人；穷途末路，心系红颜。
廉颇虽老，尚能干饭；孟德虽虚，仍念二乔。
生老病死三千疾，唯有相思不可医

山海关上挂驴鞭--天下第一der
老母猪带胸罩--一套又一套

口活堪比狗喝水，指法灵活似魔鬼。

旧时王谢堂前燕，飞入寻常百姓家。
忽有故人心上过，回首山河已是秋。
他朝若是同林雪，此生也算共白头。
鸳鸯被里成双夜，一树梨花压海棠。
情不知所起，一往而深
恨不知所终，一笑而泯
天长地久有时尽，此恨绵绵无绝期。
天涯地角有穷时，只有相思无尽处。
山无陵，江水为竭...乃敢与卿绝！
十年生死两茫茫，不思量，自难忘。
还君明珠双泪垂，恨不相逢未嫁时。
两情若是久长时，又岂在朝朝暮暮。
赌书消得泼茶香，当时只道是寻常。
此情可待成追忆，只是当时已惘然。
人生若只如初见，何事秋风悲画扇。
衣带渐宽终不悔，为伊消得人憔悴。
相见时难别亦难，东风无力百花残。
执手相看泪眼，竟无语凝噎。
一别两宽，各生欢喜。
人面不知何处去，桃花依旧笑春风。
花谢花飞花满天，红消香断有谁怜？

惊鸿一瞥，宛若游龙。
只应天上有，人间能得几回闻？
回眸一笑百媚生，六宫粉黛无颜色。
昔日芙蓉花，今成断肠草。
相看两不厌，只有敬亭山。
陌上人如玉，娘子世无双。

北方有佳人，绝世而独立，一顾倾人城，再顾倾人国。
云想衣裳花想容，春风拂槛露华浓。
娴静犹如花照水，行动好比风扶柳。

钟山风雨起苍黄，百万雄师过大江。
虎踞龙盘今胜昔，天翻地覆慨而慷。
可上九天揽月，可下五洋捉鳖，谈笑凯歌还。
为有牺牲多壮志，敢教日月换新天。
怅寥廓，问苍茫大地，谁主沉浮？
关关关难过关关过，事事难成事事成

上流社会均是下流之人
仗义每从屠狗辈，负心多是读书人

天下英雄如过江之鲫，浩浩荡荡，而我独是垂钓之人

终日奔波只为饥，方才一饱便思衣；
衣食两般皆俱足，又思娇娥美貌妻；
娶得美妻生下子，恨无田地少根基；
良田置的多广阔，出门又嫌少马骑；
槽头扣了骡和马，恐无官职被人欺；
七品县官还嫌小，又想朝中挂紫衣；
一品当朝为宰相，还想山河夺帝基；
心满意足为天子，又想长生不老期；
一旦求得长生药，再跟上帝论高低。
不足不足不知足，人生人生奈若何？
若要世人心满足，除非南柯一梦兮。

饥不择食，慌不择路，寒不择衣，贫不择妻

八千里路云和月 三十功名尘与土
报君黄金台上意，提携玉龙为君死
怒从心头起、恶向胆边生
天子一怒，伏尸百万；匹夫一怒，血溅三尺,老子一怒,就怒了一下
月黑风高夜，杀人放火天


当知足凌驾于自卑之上，幸福将会贯穿整个人生。人除了生病以外，所感受到的痛苦都是价值观带来的。人只有在知足的时候最富有，也只有在珍惜的时候最幸福。不要和别人刻意展示的精彩片段做比较。没有什么东西是永恒的。幸福既不属于富人，也不属于穷人。幸福只属于知足的人。世人皆因攀比之心而受困。殊不知攀比之心是制造痛苦的牢笼。唯有知足之人方能破茧重生。真正正的贫穷，不是囊中空空，而是欲壑难填。

"""
    print(poetry_cmd) 

def print_english_cmd():
    print("english usage command:")
    english_cmd = """
Can you can a can as a canner can can a can?
你能像罐头工人一样把罐头装起来吗

How much wood would a woodchuck chuck if a woodchuck could chuck wood? He would chuck, he would, as much as he could and chuck as much wood as a woodchuck would if a woodchuck could chuck wood

freedom is not free
   """
    print(english_cmd) 

