#!/usr/bin/python
# -*- coding: utf-8 -*-

def print_poetry_cmd():
    poetry_cmd = """
旧时王谢堂前燕，飞入寻常百姓家。
京中有善口技者，从此君王不早朝。
忽有故人心上过，回首山河已是秋。
他朝若是同林雪，此生也算共白头。
鸳鸯被里成双夜，一树梨花压海棠。
情不知所起，一往而深
天长地久有时尽，此恨绵绵无绝期。
天涯地角有穷时，只有相思无尽处。
山无陵，江水为竭...乃敢与卿绝！
十年生死两茫茫，不思量，自难忘。
还君明珠双泪垂，恨不相逢未嫁时。
两情若是久长时，又岂在朝朝暮暮。
赌书消得泼茶香，当时只道是寻常。
此情可待成追忆，只是当时已惘然。
人生若只如初见，何事秋风悲画扇。
衣带渐宽终不悔，为伊消得人憔悴。
相见时难别亦难，东风无力百花残。
执手相看泪眼，竟无语凝噎。
一别两宽，各生欢喜。
人面不知何处去，桃花依旧笑春风。
花谢花飞花满天，红消香断有谁怜？

惊鸿一瞥，宛若游龙。
只应天上有，人间能得几回闻？
回眸一笑百媚生，六宫粉黛无颜色。
昔日芙蓉花，今成断肠草。
相看两不厌，只有敬亭山。
陌上人如玉，娘子世无双。

北方有佳人，绝世而独立，一顾倾人城，再顾倾人国。
云想衣裳花想容，春风拂槛露华浓。
娴静犹如花照水，行动好比风扶柳。

钟山风雨起苍黄，百万雄师过大江。
虎踞龙盘今胜昔，天翻地覆慨而慷。
可上九天揽月，可下五洋捉鳖，谈笑凯歌还。
为有牺牲多壮志，敢教日月换新天。
怅寥廓，问苍茫大地，谁主沉浮？
   """
    print(poetry_cmd) 

